PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_autanalog_ptc.h
/***************************************************************************//**
* \file cy_autanalog_ptc.h
* \version 2.0
*
* Header file for the Programmable Threshold Comparator (PTComp) subsystem of the
* Low Power Peripheral Analog System
*
********************************************************************************
* \copyright
* Copyright 2022-2025 Cypress Semiconductor Corporation
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

/**
* \addtogroup group_autanalog_ptcomp
* \{
* This driver provides API functions to configure the PTComp subsystem of the Autonomous Analog.
*
* The PTComp block provides a pair of comparators that are used to compare the voltage on one input
* to the reference on another input.
*
* For more information on the PTComp,
* refer to the device Architecture Technical Reference Manual (TRM).\n
* For the exact location of the pins, see the device datasheet.
*
* \section group_autanalog_ptc_static Static Configuration
*
* The static configuration contains application-specific settings
* intended to remain static for any PTComp application.
* The Autonomous Controller (AC) will NOT change the static configuration during operation.
*
* \image html LPPASS_PTC_Static.png
*
* The static configuration of the Comp includes:
* - Clock divider (used in LP mode only);
* - Power mode;
* - Interrupt mode;
* - Comp hysteresis;
* - PTComp post-processing configuration, refer to \ref group_autanalog_ptc_pp section.
*
* For configuration settings, see \ref cy_stc_autanalog_ptcomp_comp_sta_t structure.
*
* \section group_autanalog_ptc_dynamic Dynamic Configuration
*
* The dynamic configuration structure includes the Comp settings,
* which can be modified by the Autonomous Controller (AC) during operation.
*
* \image html LPPASS_PTC_Dynamic.png
*
* The Autonomous Controller is able to modify the following characteristics of the PTComp in runtime
* per settings provided in the State Transition Table:
* - Enable/Disable Comp within the PTComp;
* - Change the connection of the Comp inputs;
*
* For configuration settings, see \ref cy_stc_autanalog_ptcomp_comp_dyn_t and \ref cy_stc_autanalog_stt_ptcomp_t structures.
*
* \section group_autanalog_ptc_pp Post-processing Configuration
* The PTComp contains two post-processing blocks that can be used to measure time between events and/or count events.
* The Comp state (level) or rising/falling change can be used as an input event for post-processing.
*
* The PTComp post-processing can operate in the following modes (\ref cy_stc_autanalog_ptcomp_comp_pp_t::cntMode):
* - DIRECT - the counter is configured to count the number of input events cy_stc_autanalog_ptcomp_comp_pp_t::inpSrc.
*            The condition is evaluated based on the \ref cy_en_autanalog_ptcomp_pp_cond_t every rising edge of the
*            post-processing clock (refer to chapter \ref group_autanalog_ptc_clock).
*            If the condition is met, the counter is reset.
* - FRAME - the counter is configured to count the number of input events cy_stc_autanalog_ptcomp_comp_pp_t::inpSrc
*           that occur during a given frame. The frame rate is determined by cy_stc_autanalog_ptcomp_comp_pp_t::period.
*           At the end of the frame, the condition is evaluated based on the \ref cy_en_autanalog_ptcomp_pp_cond_t
*           and the counter is reset to begin the next frame.
* - WINDOW - the counter is configured to count the number of input events cy_stc_autanalog_ptcomp_comp_pp_t::inpSrc
*            that occur inside a given window. The window size is set by cy_stc_autanalog_ptcomp_comp_pp_t::windowSize.
*            After filling the window, the condition is evaluated based on the \ref cy_en_autanalog_ptcomp_pp_cond_t
*            every rising edge of the post processor clock. The counter is not reset in this mode.
*
* The post-processing result of each Comp can be combined together using the dual-input look-up table block.
* This block implements a set of Boolean functions \ref cy_stc_autanalog_ptcomp_comp_pp_t::dataFunction and
* allows a common functional logic to be defined for a pair of Comps.
*
* \section group_autanalog_ptc_clock Clocking
* The PTComp is clocked from the SRSS peripheral clock
* (Clk_HF9, up to 80MHz, refer to \ref group_autanalog_section_configuration) in chip Active mode
* using Peri 0 Clock Group 2 8-bit divider in the clock chain.\n
* Or from the local Low Power Oscillator
* (LPOSC, 4096kHz, refer to \ref cy_en_autanalog_timer_clk_src_t) in chip Deep Sleep mode.
* The clock value can be adjusted using dedicated divider cy_stc_autanalog_ptcomp_comp_sta_t::lpDivPtcomp,
* which divides the incoming clock in chip Deep Sleep mode.
*
* \section group_autanalog_ptc_int Interrupts, Triggers and STT Events
*
* The following internal events of the PTComp can be configured to generate an interrupt or trigger
* or used as the STT event in the Autonomous Analog
* (refer to \ref cy_en_autanalog_ac_out_trigger_mask_t and \ref cy_en_autanalog_stt_ac_condition_t):
* - PTCOMP_CMPx - Indicates Comp output event;
* - PTCOMP_RANGEx - Indicates range detection conditions;
* - PTCOMP_STROBEx (STT event only) - Indicates finish of post-processing iteration and
*   readiness range conditions for evaluation (refer to \ref group_autanalog_ptc_pp chapter);
*
* \defgroup group_autanalog_ptcomp_macros Macros
* \defgroup group_autanalog_ptcomp_functions Functions
*   \{
*       \defgroup group_autanalog_ptcomp_functions_init Initialization Functions
*   \}
* \defgroup group_autanalog_ptcomp_data_structures Data Structures
* \defgroup group_autanalog_ptcomp_enums Enumerated Types
*/
#if !defined(CY_AUTANALOG_PTC_H)
#define CY_AUTANALOG_PTC_H

