PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_autanalog_ptc.h
#include "cy_device.h"

#ifdef CY_IP_MXS22LPPASS_PTC

#include "cy_autanalog_common.h"

#if defined(__cplusplus)
extern "C" {
#endif

/** \addtogroup group_autanalog_ptcomp_macros
* \{
*/

/** The maximum number of dynamic configurations that can to be used to configure the PTComp,
 *  for more details, refer to the device Architecture Technical Reference Manual.
 */
#define CY_AUTANALOG_PTCOMP_DYN_CFG_MAX                          (8UL)

/** The maximum number of post-processing configurations that can to be used to configure the PTComp,
 *  for more details, refer to the device Architecture Technical Reference Manual.
 */
#define CY_AUTANALOG_PTCOMP_PP_CFG_MAX                           (2UL)

/** \cond INTERNAL */

/* Helper macros for range validation */
#define AUTANALOG_PTCOMP_IDX(value)                              ((value) < 2UL)

/** \endcond */

/** \} group_autanalog_ptcomp_macros */

/***************************************
*       Enumerated Types
***************************************/

/**
* \addtogroup group_autanalog_ptcomp_enums
* \{
*/

/**
* Configures the power mode usage for each Comp.
* Each power setting consumes different levels of current
* and supports a different response time.
* For more details, refer to the device Architecture Technical Reference Manual.
*/
typedef enum
{
    CY_AUTANALOG_PTCOMP_COMP_PWR_OFF    = 0UL, /**< The Comp powering is off */
    CY_AUTANALOG_PTCOMP_COMP_PWR_ULP    = 1UL, /**< The Comp power mode is ULTRA LOW,\n
                                                *   the Opamp quiescent current is less then 300nA
                                                *   and response time is 7uS to 100mV overdrive */
    CY_AUTANALOG_PTCOMP_COMP_PWR_LP     = 2UL, /**< The Comp power mode is LOW,\n
                                                *   the Opamp quiescent current is less then 10uA
                                                *   and response time is 1uS to 100mV overdrive */
    CY_AUTANALOG_PTCOMP_COMP_PWR_NORMAL = 3UL, /**< The Comp power mode is NORMAL,\n
                                                *   the Opamp quiescent current is less then 150uA
                                                *   and response time is 0.1uS to 100mV overdrive */
} cy_en_autanalog_ptcomp_comp_pwr_t;


/**
* Configures 30mV hysteresis for Comp.
* For more details, refer to the device Architecture Technical Reference Manual.
*/
typedef enum
{
    CY_AUTANALOG_PTCOMP_COMP_HYST_OFF   = 0UL, /**< The Comp hysteresis is OFF */
    CY_AUTANALOG_PTCOMP_COMP_HYST_ON    = 1UL, /**< The Comp hysteresis is ON */

} cy_en_autanalog_ptcomp_comp_hyst_t;


/**
* Configures the type of edge that triggers a comparator interrupt or
* disable the interrupt entirely.
*/
typedef enum
{
    CY_AUTANALOG_PTCOMP_COMP_INT_DISABLED     = 0UL, /**< Disabled, no interrupts detected */
    CY_AUTANALOG_PTCOMP_COMP_INT_EDGE_RISING  = 1UL, /**< Rising edge generates an interrupt */
    CY_AUTANALOG_PTCOMP_COMP_INT_EDGE_FALLING = 2UL, /**< Falling edge generates an interrupt */
    CY_AUTANALOG_PTCOMP_COMP_INT_EDGE_BOTH    = 3UL, /**< Both edges generate an interrupt */

} cy_en_autanalog_ptcomp_comp_int_t;


/**
* The PTComp has possibility to configuring the switch routing matrix
* for connection of the inputs of each Comp to the different sources.
* For more details, refer to the device Architecture Technical Reference Manual
* and product datasheet for specific pin number.
*/
typedef enum
{
    CY_AUTANALOG_PTCOMP_COMP_CTB0_PIN1    = 0UL,  /**< The Comp input connected to CTB0 GPIO Pin 1 */
    CY_AUTANALOG_PTCOMP_COMP_CTB0_PIN4    = 1UL,  /**< The Comp input connected to CTB0 GPIO Pin 4 */
    CY_AUTANALOG_PTCOMP_COMP_CTB0_PIN6    = 2UL,  /**< The Comp input connected to CTB0 GPIO Pin 6 */
    CY_AUTANALOG_PTCOMP_COMP_CTB0_PIN7    = 3UL,  /**< The Comp input connected to CTB0 GPIO Pin 7 */
    CY_AUTANALOG_PTCOMP_COMP_CTB1_PIN1    = 4UL,  /**< The Comp input connected to CTB1 GPIO Pin 1 */
    CY_AUTANALOG_PTCOMP_COMP_CTB1_PIN4    = 5UL,  /**< The Comp input connected to CTB1 GPIO Pin 4 */
    CY_AUTANALOG_PTCOMP_COMP_CTB1_PIN6    = 6UL,  /**< The Comp input connected to CTB1 GPIO Pin 6 */
    CY_AUTANALOG_PTCOMP_COMP_CTB1_PIN7    = 7UL,  /**< The Comp input connected to CTB1 GPIO Pin 7 */
    CY_AUTANALOG_PTCOMP_COMP_CTB0_OA0_OUT = 8UL,  /**< The Comp input connected to CTB0 OA0 output */
    CY_AUTANALOG_PTCOMP_COMP_CTB0_OA1_OUT = 9UL,  /**< The Comp input connected to CTB0 OA1 output */
    CY_AUTANALOG_PTCOMP_COMP_CTB1_OA0_OUT = 10UL, /**< The Comp input connected to CTB1 OA0 output */
    CY_AUTANALOG_PTCOMP_COMP_CTB1_OA1_OUT = 11UL, /**< The Comp input connected to CTB1 OA1 output */
    CY_AUTANALOG_PTCOMP_COMP_DAC0         = 12UL, /**< The Comp input connected to VREF0 (from DAC0)*/
    CY_AUTANALOG_PTCOMP_COMP_DAC1         = 13UL, /**< The Comp input connected to VREF1 (from DAC1) */
    CY_AUTANALOG_PTCOMP_COMP_PRB_OUT0     = 14UL, /**< The Comp input connected to VREF2 (from PRB0) */
    CY_AUTANALOG_PTCOMP_COMP_PRB_OUT1     = 15UL, /**< The Comp input connected to VREF3 (from PRB1) */
    CY_AUTANALOG_PTCOMP_COMP_GPIO0        = 16UL, /**< The Comp input connected to SAR/PTC GPIO Pin 0 */
    CY_AUTANALOG_PTCOMP_COMP_GPIO1        = 17UL, /**< The Comp input connected to SAR/PTC GPIO Pin 1 */
    CY_AUTANALOG_PTCOMP_COMP_GPIO2        = 18UL, /**< The Comp input connected to SAR/PTC GPIO Pin 2 */
    CY_AUTANALOG_PTCOMP_COMP_GPIO3        = 19UL, /**< The Comp input connected to SAR/PTC GPIO Pin 3 */
    CY_AUTANALOG_PTCOMP_COMP_GPIO4        = 20UL, /**< The Comp input connected to SAR/PTC GPIO Pin 4 */
    CY_AUTANALOG_PTCOMP_COMP_GPIO5        = 21UL, /**< The Comp input connected to SAR/PTC GPIO Pin 5 */
    CY_AUTANALOG_PTCOMP_COMP_GPIO6        = 22UL, /**< The Comp input connected to SAR/PTC GPIO Pin 6 */
    CY_AUTANALOG_PTCOMP_COMP_GPIO7        = 23UL, /**< The Comp input connected to SAR/PTC GPIO Pin 7 */

} cy_en_autanalog_ptcomp_comp_mux_t;


/**
* Configures the source signal for the post-processing logic.
* For more details, refer to the device Architecture Technical Reference Manual.
*/
typedef enum
{
    CY_AUTANALOG_PTCOMP_PP_IN_SRC_DISABLED  = 0UL, /**< The source for post-processing is disabled */
    CY_AUTANALOG_PTCOMP_PP_IN_SRC_COMP0     = 1UL, /**< The output of COMP0 used as a source in post-processing */
    CY_AUTANALOG_PTCOMP_PP_IN_SRC_COMP1     = 2UL, /**< The output of COMP1 used as a source in post-processing */

} cy_en_autanalog_ptcomp_pp_input_src_t;


/**
* Configures the level or edge sensing type for handling two outputs from Comps in post-processing.
* For more details, refer to the device Architecture Technical Reference Manual.
*/
typedef enum
{
    CY_AUTANALOG_PTCOMP_PP_IN_TYPE_LEVEL        = 0UL, /**< The level sensitive input is used for post-processing */
    CY_AUTANALOG_PTCOMP_PP_IN_TYPE_EDGE_RISING  = 1UL, /**< The rising edge sensitive input is used for post-processing */
    CY_AUTANALOG_PTCOMP_PP_IN_TYPE_EDGE_FALLING = 2UL, /**< The falling edge sensitive input is used for post-processing */
    CY_AUTANALOG_PTCOMP_PP_IN_TYPE_EDGE_BOTH    = 3UL, /**< The both edges sensitive input is used for post-processing */

} cy_en_autanalog_ptcomp_pp_input_type_t;


/**
* Configures the post-processing operational mode, refer to \ref group_autanalog_ptc_pp.
* For more details, refer to the device Architecture Technical Reference Manual.
*/
typedef enum
{
    CY_AUTANALOG_PTCOMP_PP_CNT_MODE_DIRECT = 0UL, /**< The mode is DIRECT */
    CY_AUTANALOG_PTCOMP_PP_CNT_MODE_FRAME  = 1UL, /**< The mode is FRAME */
    CY_AUTANALOG_PTCOMP_PP_CNT_MODE_WINDOW = 2UL, /**< The mode is WINDOW */

} cy_en_autanalog_ptcomp_pp_cnt_mode_t;


/**
* Configures the size of counter window in number of clock cycles for PTComp, refer to \ref group_autanalog_ptc_pp.
* For more details, refer to the device Architecture Technical Reference Manual.
*/
typedef enum
{
    CY_AUTANALOG_PTCOMP_PP_WINDOW_TWO              = 0UL, /**< The window size of 2 */
    CY_AUTANALOG_PTCOMP_PP_WINDOW_FOUR             = 1UL, /**< The window size of 4 */
    CY_AUTANALOG_PTCOMP_PP_WINDOW_EIGHT            = 2UL, /**< The window size of 8 */
    CY_AUTANALOG_PTCOMP_PP_WINDOW_SIXTEEN          = 3UL, /**< The window size of 16 */
    CY_AUTANALOG_PTCOMP_PP_WINDOW_THIRTY_TWO       = 4UL, /**< The window size of 32 */
    CY_AUTANALOG_PTCOMP_PP_WINDOW_SIXTY_FOUR       = 5UL, /**< The window size of 64 */
    CY_AUTANALOG_PTCOMP_PP_WINDOW_ONE_TWENTY_EIGHT = 6UL, /**< The window size of 128 */

} cy_en_autanalog_ptcomp_pp_window_size_t;


/**
* Configures the logical function of the lookup table to handle two outputs from Comps in post-processing.
* For more details, refer to the device Architecture Technical Reference Manual.
*/
typedef enum
{
    CY_AUTANALOG_PTCOMP_PP_DATA_FUNC_A           = 0UL,  /**< The boolean function A */
    CY_AUTANALOG_PTCOMP_PP_DATA_FUNC_A_BAR_AND_B = 1UL,  /**< The boolean function (NOT A) AND B */
    CY_AUTANALOG_PTCOMP_PP_DATA_FUNC_B           = 2UL,  /**< The boolean function B */
    CY_AUTANALOG_PTCOMP_PP_DATA_FUNC_A_AND_B     = 3UL,  /**< The boolean function A AND B */
    CY_AUTANALOG_PTCOMP_PP_DATA_FUNC_A_AND_B_BAR = 4UL,  /**< The boolean function A AND (NOT B) */
    CY_AUTANALOG_PTCOMP_PP_DATA_FUNC_A_XOR_B     = 5UL,  /**< The boolean function A XOR B */
    CY_AUTANALOG_PTCOMP_PP_DATA_FUNC_A_OR_B      = 6UL,  /**< The boolean function A OR B */
    CY_AUTANALOG_PTCOMP_PP_DATA_FUNC_A_NOR_B     = 7UL,  /**< The boolean function NOT (A OR B) */
    CY_AUTANALOG_PTCOMP_PP_DATA_FUNC_A_XNOR_B    = 8UL,  /**< The boolean function (A OR (NOT B)) AND ((NOT A) OR B) */
    CY_AUTANALOG_PTCOMP_PP_DATA_FUNC_B_BAR       = 9UL,  /**< The boolean function NOT B */
    CY_AUTANALOG_PTCOMP_PP_DATA_FUNC_A_OR_B_BAR  = 10UL, /**< The boolean function A OR (NOT B) */
    CY_AUTANALOG_PTCOMP_PP_DATA_FUNC_A_BAR       = 11UL, /**< The boolean function NOT A */
    CY_AUTANALOG_PTCOMP_PP_DATA_FUNC_A_BAR_OR_B  = 12UL, /**< The boolean function (NOT A) OR B */
    CY_AUTANALOG_PTCOMP_PP_DATA_FUNC_A_NAND_B    = 13UL, /**< The boolean function NOT (A AND B) */

} cy_en_autanalog_ptcomp_pp_data_func_t;


/**
 * Defines the range detection conditions for the post-processing counter,
 * refer to group_autanalog_ptc_pp.
 * For more details, refer to the device Architecture Technical Reference Manual.
 */
typedef enum
{
    CY_AUTANALOG_PTCOMP_PP_COND_BELOW   = 0UL, /**< The post-processing counter must satisfy the following:\n
                                                *   counter value < cy_stc_autanalog_ptcomp_comp_pp_t::thresholdLow */
    CY_AUTANALOG_PTCOMP_PP_COND_INSIDE  = 1UL, /**< The post-processing counter must satisfy the following:\n
                                                *   (cy_stc_autanalog_ptcomp_comp_pp_t::thresholdLow <= counter value) AND
                                                *   (counter value < cy_stc_autanalog_ptcomp_comp_pp_t::thresholdHigh) */
    CY_AUTANALOG_PTCOMP_PP_COND_ABOVE   = 2UL, /**< The post-processing counter must satisfy the following:\n
                                                *   Value > cy_stc_autanalog_ptcomp_comp_pp_t::thresholdHigh */
    CY_AUTANALOG_PTCOMP_PP_COND_OUTSIDE = 3UL, /**< The post-processing counter must satisfy the following:\n
                                                *   (counter value < cy_stc_autanalog_ptcomp_comp_pp_t::thresholdLow) OR
                                                *   (counter value >= cy_stc_autanalog_ptcomp_comp_pp_t::thresholdHigh) */
} cy_en_autanalog_ptcomp_pp_cond_t;

/** \} group_autanalog_ptcomp_enums */

