PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_autanalog_ptc.h
/*******************************************************************************
* Function Name: Cy_AutAnalog_PTComp_LoadConfig
****************************************************************************//**
*
* Configures the PTComp per provided static and dynamic settings.
*
* \note Reconfiguring the Comp power mode requires a new initialization delay for the PTComp subsystem.
* Use a global API \ref Cy_AutAnalog_LoadConfig instead of the local API.
*
* \param ptcompIdx
* The index of the PTComp subsystem within the Autonomous Analog,
* see \ref cy_stc_autanalog_cfg_t::ptcomp
*
* \param ptcompCfg
* The pointer to a structure containing the static and dynamic parts of the configuration data
* for the entire PTComp.
*
* \return
* Status of initialization, \ref cy_en_autanalog_status_t.
*
*******************************************************************************/
cy_en_autanalog_status_t Cy_AutAnalog_PTComp_LoadConfig(uint8_t ptcompIdx,
        const cy_stc_autanalog_ptcomp_t *ptcompCfg);


/*******************************************************************************
* Function Name: Cy_AutAnalog_PTComp_LoadStaticConfig
****************************************************************************//**
*
* Configures the PTComp per settings in the static configuration structure.
*
* \note Reconfiguring the Comp power mode requires a new initialization delay for the PTComp subsystem.
* Use a global API \ref Cy_AutAnalog_LoadConfig instead of the local API.
*
* \note The post-processing configuration is a part of static configuration.
*
* \param ptcompIdx
* The index of the PTComp subsystem within the Autonomous Analog,
* see \ref cy_stc_autanalog_cfg_t::ptcomp
*
* \param ptcompStaCfg
* The pointer to a structure containing static configuration data for the PTComp.
*
* \return
* Status of initialization, \ref cy_en_autanalog_status_t.
*
*******************************************************************************/
cy_en_autanalog_status_t Cy_AutAnalog_PTComp_LoadStaticConfig(uint8_t ptcompIdx,
        const cy_stc_autanalog_ptcomp_comp_sta_t *ptcompStaCfg);


/*******************************************************************************
* Function Name: Cy_AutAnalog_PTComp_LoadDynamicConfig
****************************************************************************//**
*
* Configures the PTComp per settings in the dynamic configuration structure.
* The dynamic configuration of the PTComp can be modified by the Autonomous Controller during operation,
* per settings in the State Transition Table, see \ref cy_stc_autanalog_stt_t.
*
* \param ptcompIdx
* The index of the PTComp subsystem within the Autonomous Analog,
* see \ref cy_stc_autanalog_cfg_t::ptcomp
*
* \param ptcompDynCfgNum
* The actual number of dynamic configurations used to configure the PTComp.
*
* \param ptcompDynCfgArr
* The pointer to a structure containing dynamic configuration data for the PTComp.
*
* \return
* Status of initialization, \ref cy_en_autanalog_status_t.
*
*******************************************************************************/
cy_en_autanalog_status_t Cy_AutAnalog_PTComp_LoadDynamicConfig(uint8_t ptcompIdx, uint8_t ptcompDynCfgNum,
        const cy_stc_autanalog_ptcomp_comp_dyn_t *ptcompDynCfgArr);

/** \} group_autanalog_ptcomp_functions_init */


/*******************************************************************************
* Function Name: Cy_AutAnalog_PTComp_Read
****************************************************************************//**
*
* Returns the status of the comparator output.
*
* \param ptcompIdx
* The index of the PTComp subsystem within the Autonomous Analog,
* see \ref cy_stc_autanalog_cfg_t::ptcomp
*
* \param compIdx
* The index of the Comp within the PTComp.
*
* \return
* The status of the Comp output:
* - false means low;
* - true means high.
* \note Under invalid PTComp index, "false" returns in the result.
*
*******************************************************************************/
__STATIC_INLINE bool Cy_AutAnalog_PTComp_Read(uint8_t ptcompIdx, uint8_t compIdx)
{
    bool result = false;

    uint32_t baseAddr;
    uint32_t regMask;

    CY_ASSERT_L1(AUTANALOG_PTCOMP_IDX(compIdx));

    if (CY_AUTANALOG_SUCCESS == Cy_AutAnalog_IdxToBaseAddr(CY_AUTANALOG_PTC, ptcompIdx, &baseAddr))
    {
        regMask = (0UL == compIdx) ? PTC_STA_COMP_STAT_OUT0_Msk : PTC_STA_COMP_STAT_OUT1_Msk;
        result = ((AUTANALOG_PTC_COMP_STAT(baseAddr) & regMask) == regMask);
    }

    return result;
}

/** \} */

/** \} group_autanalog_ptcomp_functions */

#if defined(__cplusplus)
}
#endif

#endif /* CY_IP_MXS22LPPASS_PTC */

#endif /** !defined(CY_AUTANALOG_PTC_H) */

/** \} group_autanalog_ptcomp */

/* [] END OF FILE */
